Continued from previous comment.
<details><summary>Show Output</summary>

```diff
1_eu-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_eu-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_eu-west-3.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-3.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-3.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-3.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_eu-west-3.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-3"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_sa-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_sa-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_sa-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_sa-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_sa-east-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "sa-east-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_us-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-east-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-central-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-central-1_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_eu-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.128.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.128.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.128.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.128.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_eu-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.144.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_eu-west-3.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-3.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-3.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-3.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_eu-west-3.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "eu-west-3"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_sa-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_sa-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_sa-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_sa-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_sa-east-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "sa-east-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_us-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-east-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-north-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-north-1_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.